In [3]:
import numpy as np
import pandas as pd

In [4]:
dist1={"name":["surya","virat","rohit","dhoni"],
       "captainyear":[2024,2016,2021,2007],
       "wintropy":[0,4,10,13]
}

In [5]:
df=pd.DataFrame(dist1)

In [6]:
df

    name  captainyear  wintropy
0  surya         2024         0
1  virat         2016         4
2  rohit         2021        10
3  dhoni         2007        13

In [7]:
df.to_csv("friens.csv",index=False)

In [8]:
df.head(2)

    name  captainyear  wintropy
0  surya         2024         0
1  virat         2016         4

In [9]:

df.tail(2)

    name  captainyear  wintropy
2  rohit         2021        10
3  dhoni         2007        13

In [10]:
df.describe()

       captainyear  wintropy
count     4.000000   4.00000
mean   2017.000000   6.75000
std       7.438638   5.85235
min    2007.000000   0.00000
25%    2013.750000   3.00000
50%    2018.500000   7.00000
75%    2021.750000  10.75000
max    2024.000000  13.00000

In [11]:
raj=pd.read_csv("raj.csv")

In [12]:
raj.index=["first","second","third","fourth","fivth"]

In [13]:
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   raj

        s.no  train no   name
first      1     12647    raj
second     2     12643  rahul
third      3     12957    ram
fourth     4     12876   aman
fivth      5     12765  sumit

In [14]:
sar=pd.Series(np.random.rand(20))

In [15]:
type(sar)

pandas.core.series.Series

In [16]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [17]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.660750  0.107630  0.485814  0.867139  0.609579
1  0.219442  0.873624  0.473944  0.436351  0.261596
2  0.466560  0.791326  0.812272  0.648923  0.873119
3  0.821779  0.462666  0.392459  0.123974  0.628251
4  0.512315  0.629410  0.398298  0.437839  0.073144

In [18]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.482240    0.515266    0.522603    0.529962    0.506153
std      0.292375    0.287151    0.284107    0.277520    0.289734
min      0.003695    0.001896    0.003011    0.002801    0.002816
25%      0.219275    0.274054    0.289607    0.326075    0.257563
50%      0.468605    0.522367    0.536328    0.531638    0.517049
75%      0.725806    0.762035    0.761949    0.772008    0.768379
max      0.998810    0.999678    0.998931    0.998979    0.999365

In [19]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [20]:
newdf.head()

          0         1         2         3         4
0  0.660750  0.107630  0.485814  0.867139  0.609579
1  0.219442  0.873624  0.473944  0.436351  0.261596
2  0.466560  0.791326  0.812272  0.648923  0.873119
3  0.821779  0.462666  0.392459  0.123974  0.628251
4  0.512315  0.629410  0.398298  0.437839  0.073144

In [21]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [22]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [23]:
newdf.to_numpy()

array([[0.66074988, 0.10762952, 0.48581405, 0.86713852, 0.60957949],
       [0.21944206, 0.8736242 , 0.47394413, 0.43635128, 0.2615958 ],
       [0.46655959, 0.79132554, 0.8122721 , 0.64892252, 0.87311915],
       ...,
       [0.35349197, 0.98845586, 0.24841007, 0.93477779, 0.36032818],
       [0.68398135, 0.20775317, 0.85169318, 0.48006762, 0.34116739],
       [0.96784185, 0.15274238, 0.93412141, 0.30859052, 0.74808671]],
      shape=(334, 5))

In [24]:
newdf[0]

0      0.660750
1      0.219442
2      0.466560
3      0.821779
4      0.512315
         ...
329    0.190766
330    0.326212
331    0.353492
332    0.683981
333    0.967842
Name: 0, Length: 334, dtype: float64

In [25]:
newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.967842  0.152742  0.934121  0.308591  0.748087
332  0.683981  0.207753  0.851693  0.480068  0.341167
331  0.353492  0.988456  0.248410  0.934778  0.360328
330  0.326212  0.585528  0.038742  0.065472  0.606244
329  0.190766  0.264199  0.622411  0.993727  0.545138
..        ...       ...       ...       ...       ...
4    0.512315  0.629410  0.398298  0.437839  0.073144
3    0.821779  0.462666  0.392459  0.123974  0.628251
2    0.466560  0.791326  0.812272  0.648923  0.873119
1    0.219442  0.873624  0.473944  0.436351  0.261596
0    0.660750  0.107630  0.485814  0.867139  0.609579

[334 rows x 5 columns]

In [26]:
newdf.head(2)

          0         1         2         3         4
0  0.660750  0.107630  0.485814  0.867139  0.609579
1  0.219442  0.873624  0.473944  0.436351  0.261596

In [27]:
newdf.columns= list("abcde")

In [28]:
newdf.loc[0,'A']=456

In [29]:
newdf=newdf.drop(0,axis=1)

KeyError: '[0] not found in axis'

In [ ]:
newdf.loc[[1,2], ['c','d']]

In [ ]:
newdf.loc[[1,2], :]

In [30]:
newdf.loc[(newdf['a']>0.8)]

            a         b         c         d         e   A
3    0.821779  0.462666  0.392459  0.123974  0.628251 NaN
5    0.972885  0.514446  0.640523  0.914722  0.832549 NaN
10   0.891483  0.317281  0.183190  0.915986  0.504979 NaN
11   0.903010  0.949025  0.834953  0.292565  0.560934 NaN
12   0.839534  0.534744  0.105419  0.479890  0.379889 NaN
..        ...       ...       ...       ...       ...  ..
307  0.817888  0.655249  0.778526  0.339613  0.715662 NaN
314  0.911711  0.593277  0.607434  0.531077  0.109748 NaN
316  0.891145  0.421665  0.953586  0.225475  0.502376 NaN
326  0.897571  0.335273  0.358326  0.663793  0.964847 NaN
333  0.967842  0.152742  0.934121  0.308591  0.748087 NaN

[65 rows x 6 columns]

In [31]:
newdf.iloc[0,4]

np.float64(0.6095794897351501)

In [32]:
newdf.iloc[[0,4],[2,3]]

          c         d
0  0.485814  0.867139
4  0.398298  0.437839

In [33]:
newdf.drop([5,8],inplace=True)

In [34]:
newdf.reset_index(drop=True,inplace=True)

In [35]:
newdf.head(4)

          a         b         c         d         e      A
0  0.660750  0.107630  0.485814  0.867139  0.609579  456.0
1  0.219442  0.873624  0.473944  0.436351  0.261596    NaN
2  0.466560  0.791326  0.812272  0.648923  0.873119    NaN
3  0.821779  0.462666  0.392459  0.123974  0.628251    NaN

In [36]:
newdf['b'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: b, Length: 332, dtype: bool

In [37]:
newdf.drop_duplicates(keep=False)

            a         b         c         d         e      A
0    0.660750  0.107630  0.485814  0.867139  0.609579  456.0
1    0.219442  0.873624  0.473944  0.436351  0.261596    NaN
2    0.466560  0.791326  0.812272  0.648923  0.873119    NaN
3    0.821779  0.462666  0.392459  0.123974  0.628251    NaN
4    0.512315  0.629410  0.398298  0.437839  0.073144    NaN
..        ...       ...       ...       ...       ...    ...
327  0.190766  0.264199  0.622411  0.993727  0.545138    NaN
328  0.326212  0.585528  0.038742  0.065472  0.606244    NaN
329  0.353492  0.988456  0.248410  0.934778  0.360328    NaN
330  0.683981  0.207753  0.851693  0.480068  0.341167    NaN
331  0.967842  0.152742  0.934121  0.308591  0.748087    NaN

[332 rows x 6 columns]

In [38]:
newdf.shape

(332, 6)

In [39]:
newdf.info

<bound method DataFrame.info of             a         b         c         d         e      A
0    0.660750  0.107630  0.485814  0.867139  0.609579  456.0
1    0.219442  0.873624  0.473944  0.436351  0.261596    NaN
2    0.466560  0.791326  0.812272  0.648923  0.873119    NaN
3    0.821779  0.462666  0.392459  0.123974  0.628251    NaN
4    0.512315  0.629410  0.398298  0.437839  0.073144    NaN
..        ...       ...       ...       ...       ...    ...
327  0.190766  0.264199  0.622411  0.993727  0.545138    NaN
328  0.326212  0.585528  0.038742  0.065472  0.606244    NaN
329  0.353492  0.988456  0.248410  0.934778  0.360328    NaN
330  0.683981  0.207753  0.851693  0.480068  0.341167    NaN
331  0.967842  0.152742  0.934121  0.308591  0.748087    NaN

[332 rows x 6 columns]>

In [40]:
newdf['a'].value_counts(dropna=False)

a
0.660750    1
0.219442    1
0.466560    1
0.821779    1
0.512315    1
           ..
0.190766    1
0.326212    1
0.353492    1
0.683981    1
0.967842    1
Name: count, Length: 332, dtype: int64

In [49]:
data1 = pd.read_excel('students details.xlsx')

In [50]:
data1

,RNM Scool Data,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,,Unnamed: 13,Unnamed: 14,Unnamed: 15
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Retrieving data. Wait a few seconds and try to...,Gender,Age,Class,Adress,Unit 1 Total,Mid exam,Unit 2 Total,Final Exam,Avg Number,percentage,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,marks 20,Marks 100,marks 20,marks 100,marks 240,%,grade final,NaN,NaN,NaN,NaN
4,Abhay,M,12,12,Moti jhill,8,49,14,67,138,58,third,NaN,sum if,NaN,NaN
5,Alok,M,13,12,Madhav nagar,6,57,15,56,134,56,third,NaN,Gender,Final score f,NaN
6,Arav,M,15,12,Ramiya nagar,9,84,12,58,163,68,second,NaN,F,296,NaN
7,Arjun,M,12,12,Sawajpur,14,56,11,75,156,65,second,NaN,NaN,NaN,NaN
8,Avni,F,16,12,Saket nagat,13,12,15,87,127,53,fail,NaN,NaN,NaN,NaN
9,Madhur,M,12,12,Qutar,13,57,19,91,180,75,FIRST,NaN,NaN,NaN,NaN
10,Madhuri,F,12,12,Jhaki,19,85,14,74,192,80,FIRST,NaN,sumifs,NaN,NaN
11,Mona,F,14,12,Aniwar ganj,8,39,15,92,154,65,second,NaN,Gender,Age,final
12,Monu,M,12,12,Ramaipur,15,65,17,69,166,70,second,NaN,M,12,302
13,Raj,M,16,12,Pipargaon,16,76,12,78,182,76,FIRST,NaN,NaN,NaN,NaN
14,Ramya,F,15,12,Jhasi,13,46,15,65,139,58,third,NaN,NaN,NaN,NaN
15,Rani,F,12,12,Manipur,11,85,16,49,161,68,second,NaN,Countif,NaN,NaN
16,Sonu,M,16,12,Sagunpur,12,39,16,75,142,60,third,NaN,Age,cout age,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,12,6,NaN
18,NaN,NaN,192,NaN,NaN,104,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,192,NaN,NaN,117,NaN,NaN,13,NaN,13,NaN,NaN,Countifs,NaN,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,O,NaN,NaN,Gender,Age,count
21,NaN,NaN,127,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,F,12,2
22,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN